In [139]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
sns.set()

In [114]:
application_details = pd.read_csv('./data/application_record 2.csv')
credit_records = pd.read_csv('./data/credit_record.csv')

In [115]:
application_details.describe().T

,count,mean,std,min,25%,50%,75%,max
ID,438557.0,6.022176e+06,571637.023257,5008804.0,5609375.0,6047745.0,6456971.0,7999952.0
CNT_CHILDREN,438557.0,4.273903e-01,0.724882,0.0,0.0,0.0,1.0,19.0
AMT_INCOME_TOTAL,438557.0,1.875243e+05,110086.853066,26100.0,121500.0,160780.5,225000.0,6750000.0
DAYS_BIRTH,438557.0,-1.599790e+04,4185.030007,-25201.0,-19483.0,-15630.0,-12514.0,-7489.0
DAYS_EMPLOYED,438557.0,6.056368e+04,138767.799647,-17531.0,-3103.0,-1467.0,-371.0,365243.0
FLAG_MOBIL,438557.0,1.000000e+00,0.000000,1.0,1.0,1.0,1.0,1.0
FLAG_WORK_PHONE,438557.0,2.061328e-01,0.404527,0.0,0.0,0.0,0.0,1.0
FLAG_PHONE,438557.0,2.877710e-01,0.452724,0.0,0.0,0.0,1.0,1.0
FLAG_EMAIL,438557.0,1.082071e-01,0.310642,0.0,0.0,0.0,0.0,1.0
CNT_FAM_MEMBERS,438557.0,2.194465e+00,0.897207,1.0,2.0,2.0,3.0,20.0

In [116]:
credit_records.describe().T

,count,mean,std,min,25%,50%,75%,max
ID,1048575.0,5.068286e+06,46150.578505,5001711.0,5023644.0,5062104.0,5113856.0,5150487.0
MONTHS_BALANCE,1048575.0,-1.913700e+01,14.023498,-60.0,-29.0,-17.0,-7.0,0.0

In [117]:
credit_records.tail()

              ID  MONTHS_BALANCE STATUS
1048570  5150487             -25      C
1048571  5150487             -26      C
1048572  5150487             -27      C
1048573  5150487             -28      C
1048574  5150487             -29      C

In [118]:
np.unique(credit_records['STATUS'])

array(['0', '1', '2', '3', '4', '5', 'C', 'X'], dtype=object)

- According to source data, credit_records has the following information:
Feature name	Explanation	Remarks
ID	Client number	
- 0 is the current month, 
- -1 is the previous month, and so on
STATUS	Status	
- 0: 1-29 days past due 
- 1: 30-59 days past due 
- 2: 60-89 days overdue 
- 3: 90-119 days overdue 
- 4: 120-149 days overdue 
- 5: Overdue or bad debts, 
- write-offs for more than 150 days 
- C: paid off that month 
- X: No loan for the month

# Converting credit_record status to binary data

In [119]:
convert_to = {'C' : 'Good_Debt', 'X' : 'Good_Debt', '0' : 'Good_Debt', '1' : 'Neutral_Debt', '2' : 'Neutral_Debt', '3' : 'Bad_Debt', '4' : 'Bad_Debt', '5' : 'Bad_Debt'}
credit_records.replace({'STATUS' : convert_to}, inplace=True)

In [120]:
credit_records

              ID  MONTHS_BALANCE     STATUS
0        5001711               0  Good_Debt
1        5001711              -1  Good_Debt
2        5001711              -2  Good_Debt
3        5001711              -3  Good_Debt
4        5001712               0  Good_Debt
...          ...             ...        ...
1048570  5150487             -25  Good_Debt
1048571  5150487             -26  Good_Debt
1048572  5150487             -27  Good_Debt
1048573  5150487             -28  Good_Debt
1048574  5150487             -29  Good_Debt

[1048575 rows x 3 columns]

- Convert status into approval status

In [121]:
credit_records.loc[credit_records['STATUS'] == 'Good_Debt', 'APPROVAL_STATUS'] = 1
credit_records.loc[credit_records['STATUS'] == 'Bad_Debt', 'APPROVAL_STATUS'] = 0

In [122]:
credit_records

              ID  MONTHS_BALANCE     STATUS  APPROVAL_STATUS
0        5001711               0  Good_Debt              1.0
1        5001711              -1  Good_Debt              1.0
2        5001711              -2  Good_Debt              1.0
3        5001711              -3  Good_Debt              1.0
4        5001712               0  Good_Debt              1.0
...          ...             ...        ...              ...
1048570  5150487             -25  Good_Debt              1.0
1048571  5150487             -26  Good_Debt              1.0
1048572  5150487             -27  Good_Debt              1.0
1048573  5150487             -28  Good_Debt              1.0
1048574  5150487             -29  Good_Debt              1.0

[1048575 rows x 4 columns]

In [123]:
application_details.isnull().sum()

ID                          0
CODE_GENDER                 0
FLAG_OWN_CAR                0
FLAG_OWN_REALTY             0
CNT_CHILDREN                0
AMT_INCOME_TOTAL            0
NAME_INCOME_TYPE            0
NAME_EDUCATION_TYPE         0
NAME_FAMILY_STATUS          0
NAME_HOUSING_TYPE           0
DAYS_BIRTH                  0
DAYS_EMPLOYED               0
FLAG_MOBIL                  0
FLAG_WORK_PHONE             0
FLAG_PHONE                  0
FLAG_EMAIL                  0
OCCUPATION_TYPE        134203
CNT_FAM_MEMBERS             0
dtype: int64

- about one third of the record has null value in OCCUPATION_TYPE column

In [124]:
application_details = application_details.dropna()

In [125]:
application_details.isnull().sum()

ID                     0
CODE_GENDER            0
FLAG_OWN_CAR           0
FLAG_OWN_REALTY        0
CNT_CHILDREN           0
AMT_INCOME_TOTAL       0
NAME_INCOME_TYPE       0
NAME_EDUCATION_TYPE    0
NAME_FAMILY_STATUS     0
NAME_HOUSING_TYPE      0
DAYS_BIRTH             0
DAYS_EMPLOYED          0
FLAG_MOBIL             0
FLAG_WORK_PHONE        0
FLAG_PHONE             0
FLAG_EMAIL             0
OCCUPATION_TYPE        0
CNT_FAM_MEMBERS        0
dtype: int64

**Convert days data to readable years format**

In [126]:
application_details['AGE'] = np.ceil(pd.to_timedelta(application_details['DAYS_BIRTH'], unit='D').dt.days / -365.25)

In [127]:
application_details.drop('DAYS_BIRTH', axis=1, inplace=True)

In [128]:
# Checking Data after converting DAYS_BIRTH to AGES
application_details.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 304354 entries, 2 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   304354 non-null  int64
 1   CODE_GENDER          304354 non-null  object
 2   FLAG_OWN_CAR         304354 non-null  object
 3   FLAG_OWN_REALTY      304354 non-null  object
 4   CNT_CHILDREN         304354 non-null  int64
 5   AMT_INCOME_TOTAL     304354 non-null  float64
 6   NAME_INCOME_TYPE     304354 non-null  object
 7   NAME_EDUCATION_TYPE  304354 non-null  object
 8   NAME_FAMILY_STATUS   304354 non-null  object
 9   NAME_HOUSING_TYPE    304354 non-null  object
 10  DAYS_EMPLOYED        304354 non-null  int64
 11  FLAG_MOBIL           304354 non-null  int64
 12  FLAG_WORK_PHONE      304354 non-null  int64
 13  FLAG_PHONE           304354 non-null  int64
 14  FLAG_EMAIL           304354 non-null  int64
 15  OCCUPATION_TYPE      304354 non-null  object
 16  CNT_FAM_MEMBERS      304354 non-null  float64
 17  AGE                  304354 non-null  float64
dtypes: float64(3), int64(7), object(8)
memory usage: 44.1+ MB

In [129]:
application_details.loc[(application_details['DAYS_EMPLOYED'] > 0), 'DAYS_EMPLOYED'] = 0
application_details['YEARS_EMPLOYED'] = np.ceil(pd.to_timedelta(application_details['DAYS_EMPLOYED'], unit='D').dt.days / -365.25)

In [138]:
application_details.drop('DAYS_EMPLOYED', axis=1, inplace=True)

AttributeError: 'NoneType' object has no attribute 'drop'

In [137]:
# Checking Data after converting DAYS_BIRTH to AGES
application_details.info()

AttributeError: 'NoneType' object has no attribute 'info'

In [132]:
def Cat_to_Num(features):
    for feature in features:
        feature_list = list(np.unique(application_details[feature]))
        feature_dict = {}
        for i in range(len(feature_list)):
                       feature_dict[feature_list[i]] = i
        application_details.replace({feature : feature_dict}, inplace=True)
        print(feature, '-->', feature_dict)

In [133]:
categorical_features = ['CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'NAME_INCOME_TYPE', 'NAME_FAMILY_STATUS', 'OCCUPATION_TYPE', 'NAME_HOUSING_TYPE', 'NAME_EDUCATION_TYPE']
application_details = Cat_to_Num(categorical_features)

CODE_GENDER --> {'F': 0, 'M': 1}
FLAG_OWN_CAR --> {'N': 0, 'Y': 1}
FLAG_OWN_REALTY --> {'N': 0, 'Y': 1}
NAME_INCOME_TYPE --> {'Commercial associate': 0, 'Pensioner': 1, 'State servant': 2, 'Student': 3, 'Working': 4}
NAME_FAMILY_STATUS --> {'Civil marriage': 0, 'Married': 1, 'Separated': 2, 'Single / not married': 3, 'Widow': 4}
OCCUPATION_TYPE --> {'Accountants': 0, 'Cleaning staff': 1, 'Cooking staff': 2, 'Core staff': 3, 'Drivers': 4, 'HR staff': 5, 'High skill tech staff': 6, 'IT staff': 7, 'Laborers': 8, 'Low-skill Laborers': 9, 'Managers': 10, 'Medicine staff': 11, 'Private service staff': 12, 'Realty agents': 13, 'Sales staff': 14, 'Secretaries': 15, 'Security staff': 16, 'Waiters/barmen staff': 17}
NAME_HOUSING_TYPE --> {'Co-op apartment': 0, 'House / apartment': 1, 'Municipal apartment': 2, 'Office apartment': 3, 'Rented apartment': 4, 'With parents': 5}
NAME_EDUCATION_TYPE --> {'Academic degree': 0, 'Higher education': 1, 'Incomplete higher': 2, 'Lower secondary': 3, 'Secondary / secondary special': 4}

In [136]:
application_details

In [ ]:
credit_data_merged = application_details.merge(credit_records, how='inner', on=['ID'])

In [ ]:
credit_data_merged.describe().T

In [ ]:
credit_data_merged.head()

In [ ]:
credit_data_merged.info()

- Out of 1048575 records in credit_records, there are 777715 entries that has matching ID in both application_records and credit_records

In [ ]:
 credit_approval_data = credit_data_merged.drop('ID', axis=1, inplace=False)

In [ ]:
credit_approval_data

# Training , Featuring Credit approval

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
credit_approval_data = credit_approval_data.dropna()

In [ ]:
X = credit_approval_data.drop('APPROVAL_STATUS', axis=1)
y = credit_approval_data['APPROVAL_STATUS']
credit_approval_data['APPROVAL_STATUS'] = credit_approval_data['APPROVAL_STATUS'].astype('int')

In [ ]:
credit_approval_data

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

In [ ]:
from sklearn.tree import DecisionTreeClassifier

In [ ]:
DT_model = DecisionTreeClassifier()

In [ ]:
DT_model.fit(X_train, y_train)